Bookers2/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("name", "introduction", "profile_image_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "testname"], ["introduction", "testintroduction"], ["profile_image_id", nil], ["user_id", 1], ["created_at", "2020-03-20 11:40:33.452552"], ["updated_at", "2020-03-20 11:40:33.452552"]]
---
    def create
        @user = current_user
        @books = Book.all
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @user = current_user
        @book = Book.new
        @showBook = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @user = current_user
        @book = Book.new
        @myBook = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "タイトル2"], ["body", "感想2"], ["updated_at", "2020-03-22 06:58:28.746869"], ["id", 2]]
---
    def update
        @user = current_user
        @book = Book.new
        @myBook = Book.find(params[:id])
        if @myBook.update(book_params)